---
kind: type
id: T:Autodesk.Revit.DB.Level
zh: 标高
source: html/577e5d4e-a558-118c-9dea-3b810b061775.htm
---
# Autodesk.Revit.DB.Level

**中文**: 标高

Represents a Level within Autodesk Revit.

## Syntax (C#)
```csharp
public class Level : DatumPlane
```

## Remarks
A Level is conceptually a horizontal rectangle of finite extents. It appears as a straight line in views that intersect
 the rectangle. The straight line represents the projection of the rectangle onto the view.
The Name property can be used to retrieve the user visible name of the level that appears in the level bubble.